<template>
  <div id="product2">
    <div class="product">
      <img class="product__image" alt="2" src="../images/SliderTop/2.jpg" />
      <div class="product__text-button">
        Мицеллярный шампунь с уникальным комплексом активных компонентов для
        укрепления волос у корней и интенсивного ухода по всей длине.
        Великолепно растворяет и удаляет остатки мусса, лака, силиконов, масел и
        загрязнений окружающей среды (выхлопы, токсины). *KERATRIX —
        запатентованная многофункциональная формула, содержащая пептиды и
        свободные аминокислоты из семян рожкового дерева. Имеет 3D-структуру,
        которая обволакивает поверхность волоса, «склеивает» чешуйки и
        препятствует испарению влаги с поверхности волоса. **МУЦИН ГНЕЗД
        САЛАНГАНА - инновационный актив богатый микроэлементами и
        аминокислотами, содержит йод, повышает иммунитет кожи и регенерацию
        тканей, способствует укреплению волосяных луковиц.
        ***Д-ПАНТЕНОЛ/ПРОВИТАМИН В5 останавливает выпадение волос, ускоряет их
        рост и восстановление изнутри. Мицеллярный бальзам с уникальным
        комплексом активных компонентов для укрепления волос у корней и
        интенсивного питания по всей длине. Состав действует на волосяные
        луковицы, улучшает кровообращение и тонизирует кожный покров. *KERATRIX
        — запатентованная многофункциональная формула, содержащая пептиды и
        свободные аминокислоты из семян рожкового дерева. Keratrix имеет 3D
        структуру, которая обволакивает поверхность волоса, «склеивает» чешуйки
        и препятствует испарению влаги с поверхности волоса. **МУЦИН ГНЕЗД
        САЛАНГАНА - инновационный актив богатый микроэлементами и
        аминокислотами, содержит йод, повышает иммунитет кожи и регенерацию
        тканей, способствует укреплению волосяных луковиц.
        ***Д-ПАНТЕНОЛ/ПРОВИТАМИН В5 останавливает выпадение волос, ускоряет их
        рост и восстановление изнутри. Укрепляющая терапия + эффективная защита
        волос от высоких температур с активным комплексом нового поколения.
        Спрей эффективен для "домашнего" использования (фен, утюжок) при
        воздействии температуры до 180оС, а так же для профессиональных
        процедур, которые проводятся при температурах до 300оС (ламинирование и
        выпрямление). *SILSOFT AX-E предотвращает поднятие чешуек кутикулы,
        формируя на поверхности волоса защитную пленку. **ПРОВИТАМИН В5
        дополнительно укрепляет и стимулирует рост волос. Цена 310 грн
        <button
          @click="
            increment();
            sumaSum2();
            nameProduct2();
          "
          class="product__button"
        >
          Купити
        </button>
      </div>
    </div>
  </div>
</template>
<script>
import { mapState, mapActions } from "vuex";
export default {
  name: "product2",
  props: {},
  data() {
    return {};
  },
  computed: {
    ...mapState(["count", "suma", "nameProduct"]),
  },
  methods: {
    ...mapActions([
      "increment",
      "decrement",
      "reset",
      "sumaSum1",
      "sumaSum2",
      "sumaSum3",
      "sumaSum4",
      "sumaSum5",
      "sumaSum6",
      "sumaSum7",
      "sumaSum8",
      "sumaSum9",
      "sumaSum10",
      "nameProduct1",
      "nameProduct2",
      "nameProduct3",
      "nameProduct4",
      "nameProduct5",
      "nameProduct6",
      "nameProduct7",
      "nameProduct8",
      "nameProduct9",
      "nameProduct10",
    ]),
  },
};
</script>
<style lang="scss">
.product {
  display: flex;
  justify-content: space-around;
  padding: 20px;
  &__image {
    width: 400px;
    height: 400px;
  }
  &__text-button {
    width: 400px;
    display: flex;
    flex-direction: column;
    justify-content: center;
  }
  &__button {
    margin-top: 20px;
    width: 100%;
    height: 30px;
    background-color: purple;
    color: white;
  }
}
</style>
